In [1]:
import pandas as pd
import seaborn as sns

In [2]:
cast = pd.read_csv('C:/Users/DELL/Desktop/Datascience Course/cast.csv')
cast.head()

,title,year,name,type,character,n
0,Closet Monster,2015.0,Buffy #1,actor,Buffy 4,NaN
1,Suuri illusioni,1985.0,Homo $,actor,Guests,22.0
2,Battle of the Sexes,2017.0,$hutter,actor,Bobby Riggs Fan,10.0
3,Secret in Their Eyes,2015.0,$hutter,actor,2002 Dodger Fan,NaN
4,Steve Jobs,2015.0,$hutter,actor,1988 Opera House Patron,NaN

### How many movies are listed in the titles dataframe?

In [3]:
rows = cast.shape[0]         ### no.of rows
column = cast.columns[0]     ### Column name
print("The listed movies under the {}".format(column),"dataframe are {}".format(rows))

The listed movies under the title dataframe are 2159949

### What are the earliest two films listed in the titles dataframe?

In [4]:
index_year = cast.set_index('year')  ## set index as year
sort       = index_year.sort_index(ascending = False) # sort data in decending order
Records    = sort.head(2) ### get latest two records data

print("The Earliest Two Films are ")

Records

The Earliest Two Films are

            title              name   type character   n
year
2023.0  Xenomorph  Max (IV) Kaufman  actor      Jake NaN
2023.0  Inside Me    Antonio Alcala  actor       Max NaN

### How many movies have the title "Hamlet"?

In [5]:
title_index = cast.set_index('title')          ## Set the index by title
title       = title_index.loc['Hamlet']        ## filter index with title Hamlet
total_movies= title.shape[0]                   ## Count the number movies 

print("Total movies with the title of 'Hamlet' are {}".format(total_movies))  #display output

Total movies with the title of 'Hamlet' are 218

### How many movies are titled "North by Northwest"?

In [6]:
title_index1 = cast.set_index('title')          ## Set the index by title

title1       = title_index1.loc['North by Northwest']        ## filter index with title North by Nortwest

total        = title1.shape[0]                   ## Count the number movies 

print("Total movies with the title of 'North by Nortwest' are {}".format(total))  #display output

Total movies with the title of 'North by Nortwest' are 81

### When was the first movie titled "Hamlet" made?

In [9]:
a = cast[(cast['title']=='Hamlet')].year.min()
value = int(a)
print("The first movie titled 'Hamlet' is made in the year of {}".format(value))

The first movie titled 'Hamlet' is made in the year of 1910

### List all of the "Treasure Island" movies from earliest to most recent.

In [16]:
a = cast[(cast['title']=='Treasure Island')]
a.sort_values(by = 'year')

,title,year,name,type,character,n
1291387,Treasure Island,1918.0,Elmo Lincoln,actor,Prologue Player,NaN
830114,Treasure Island,1918.0,Charles Gorman,actor,Prologue Player,NaN
840745,Treasure Island,1918.0,Joe Grant,actor,Undetermined child role,NaN
909157,Treasure Island,1918.0,Edwin Harley,actor,Prologue Player,NaN
1946119,Treasure Island,1918.0,Lewis Sargent,actor,Ben Gunn,5.0
...,...,...,...,...,...,...
1959741,Treasure Island,1999.0,Richard Schave,actor,Man,21.0
872384,Treasure Island,1999.0,Paul Gutrecht,actor,Some Guy,20.0
210668,Treasure Island,1999.0,Jonah Blechman,actor,The Body,3.0
1869989,Treasure Island,1999.0,Scot Thomas Robinson,actor,Jimmy,11.0
880460,Treasure Island,1999.0,Rio Hackford,actor,Hans,23.0

### How many movies were made in the year 1950?

In [17]:
data = cast.groupby(cast['year']==1950)['title'].count()  #groupby the year with condition
total = data.loc[1]                                       #display count by index
print("Total No.of Moives made in the year of 1950 were - {}".format(total))

Total No.of Moives made in the year of 1950 were - 14653

### How many movies were made in the year 1960?

In [18]:
data = cast.groupby(cast['year']==1960)['title'].count()  #groupby the year with condition
total = data.loc[1]                                       #display count by index
print("Total No.of Moives made in the year of 1950 were - {}".format(total))

Total No.of Moives made in the year of 1950 were - 11551

### How many movies were made from 1950 through 1959?

In [19]:
data = cast.groupby((cast['year']>1950) & (cast['year']<=1959))['title'].count()  #groupby the year with condition
total = data.loc[1]                                       #display count by index
print("Total No.of Moives made from 1950 to 1959 were - {}".format(total))

Total No.of Moives made from 1950 to 1959 were - 122755

### In what years has a movie titled "Batman" been released?

In [20]:
a = cast[(cast['title']=='Batman')]
a.loc[:,['title','year']]

          title    year
95672    Batman  1943.0
96186    Batman  1943.0
114034   Batman  1989.0
119476   Batman  1989.0
149767   Batman  1989.0
...         ...     ...
2068050  Batman  1989.0
2096318  Batman  1989.0
2099960  Batman  1989.0
2115809  Batman  1989.0
2152546  Batman  1989.0

[89 rows x 2 columns]

### How many roles were there in the movie "Inception"?

In [21]:
data = cast.groupby(cast['title']=='Inception')['character'].count()  #groupby the title with condition and character
total = data.loc[1]                                       #display count by index
print("Total No.of Roles in the movie 'Inception' are  - {}".format(total))

Total No.of Roles in the movie 'Inception' are  - 52

### How many roles in the movie "Inception" are NOT ranked by an "n" value?

In [24]:
value = len(cast[(cast.title == 'Inception') & (cast.n.isnull())])
print("Total No.of Roles in the movie 'Inception' are not ranked by 'n' value are  - {}".format(value))

Total No.of Roles in the movie 'Inception' are not ranked by 'n' value are  - 21

### But how many roles in the movie "Inception" did receive an "n" value?

In [25]:
value = len(cast[(cast.title == 'Inception') & (cast.n.notnull())])
print("Total No.of Roles in the movie 'Inception' are ranked by 'n' value are  - {}".format(value))

Total No.of Roles in the movie 'Inception' are ranked by 'n' value are  - 31

### Display the cast of "North by Northwest" in their correct "n"-value order, ignoring roles that did not earn a numeric "n" value.¶

In [26]:
cast[(cast.title == 'North by Northwest') & (cast.n.notnull())].sort_values(by = 'n')

,title,year,name,type,character,n
840374,North by Northwest,1959.0,Cary Grant,actor,Roger O. Thornhill,1.0
1404704,North by Northwest,1959.0,James Mason,actor,Phillip Vandamm,3.0
343701,North by Northwest,1959.0,Leo G. Carroll,actor,The Professor,5.0
1634552,North by Northwest,1959.0,Philip Ober,actor,Lester Townsend,7.0
1229083,North by Northwest,1959.0,Martin Landau,actor,Leonard,8.0
1746383,North by Northwest,1959.0,Edward Platt,actor,Victor Larrabee,10.0
642085,North by Northwest,1959.0,Robert Ellenstein,actor,Licht,11.0
447893,North by Northwest,1959.0,Philip Coolidge,actor,Dr. Cross,13.0
1454363,North by Northwest,1959.0,Patrick McVey,actor,Sergeant Flamm,14.0
198496,North by Northwest,1959.0,Edward Binns,actor,Captain Junket,15.0
1334726,North by Northwest,1959.0,Ken Lynch,actor,Charley - Chicago Policeman,16.0

### Display the entire cast, in "n"-order, of the 1972 film "Sleuth".

In [27]:
def n_order(x,y):
    cast_list = cast[(cast['title']== x) & (cast['year'] == y)]
    value     = cast_list.loc[:,['title','year','n']]
    return value

In [28]:
n_order('Sleuth',1972)

          title    year    n
314691   Sleuth  1972.0  2.0
360365   Sleuth  1972.0  3.0
1396572  Sleuth  1972.0  6.0
1412647  Sleuth  1972.0  4.0
1644328  Sleuth  1972.0  1.0

### Now display the entire cast, in "n"-order, of the 2007 version of "Sleuth".

In [29]:
n_order('Sleuth',2007)

          title    year    n
250297   Sleuth  2007.0  NaN
314692   Sleuth  2007.0  1.0
360366   Sleuth  2007.0  NaN
1246855  Sleuth  2007.0  2.0
1741124  Sleuth  2007.0  3.0

### How many roles were credited in the silent 1921 version of Hamlet?

In [30]:
def roles(t,y):
    value = len(cast[(cast['title'] == t) & (cast['year'] == y)])
    return value

In [32]:
r = roles('Hamlet',1921)
print("The no.of roles credited for 'Hamlet' in '1921' were {}".format(r))

The no.of roles credited for 'Hamlet' in '1921' were 5

### How many roles were credited in Branagh’s 1996 Hamlet?

In [34]:
r = roles('Hamlet',1996)
print("The no.of roles credited for 'Hamlet' in '1996' were {}".format(r))

The no.of roles credited for 'Hamlet' in '1996' were 38

### How many "Hamlet" roles have been listed in all film credits through history?

In [35]:
def length(x):
    value = len(cast[cast.character == x])
    return value

In [39]:
l = length('Hamlet')
print("The no.of roles have been istedd in all film credit through history were '{}'".format(l))

The no.of roles have been istedd in all film credit through history were '78'

### How many people have played an "Ophelia"?

In [40]:
l = length('Ophelia')
print("The no.of roles have been istedd in all film credit through history were '{}'".format(l))

The no.of roles have been istedd in all film credit through history were '7'

### How many people have played a role called "The Dude"?

In [42]:
l = length('The Dude')
print("The no.of roles have been istedd in all film credit through history were '{}'".format(l))

The no.of roles have been istedd in all film credit through history were '16'

### How many people have played a role called "The Stranger"?

In [43]:
l = length('The Stranger')
print("The no.of roles have been istedd in all film credit through history were '{}'".format(l))

The no.of roles have been istedd in all film credit through history were '184'

### How many roles has Sidney Poitier played throughout his career?

In [45]:
def name(x):
    value = len(cast[(cast.name == x)])
    return value

In [47]:
n = name("Sidney Poitier")
print("The no.of roles has played by Sidney Poitier were '{}'".format(n))

The no.of roles has played by Sidney Poitier were '43'

### How many roles has Judi Dench played?

In [48]:
n = name("Judi Dench ")
print("The no.of roles has played by Judi Dench were '{}'".format(n))

The no.of roles has played by Judi Dench were '0'

### List the supporting roles (having n=2) played by Cary Grant in the 1940s, in order by year.

In [49]:
def disp(x,y,z):
    value = cast[(cast.n == x) & (cast.name == y) & (cast.year == z)].sort_values(by = 'year')
    return value

In [50]:
disp(2,'Cary Grant',1940)

                   title    year        name   type character    n
840371  My Favorite Wife  1940.0  Cary Grant  actor      Nick  2.0

### List the leading roles that Cary Grant played in the 1940s in order by year.

In [51]:
disp(1,'Cary Grant',1940)

,title,year,name,type,character,n
840353,His Girl Friday,1940.0,Cary Grant,actor,Walter Burns,1.0
840397,The Howards of Virginia,1940.0,Cary Grant,actor,Matt Howard,1.0
840399,The Philadelphia Story,1940.0,Cary Grant,actor,C. K. Dexter Haven,1.0

### How many roles were available for actors in the 1950s

In [52]:
def char_type(x,y):
    value = len(cast[(cast.type == x) & (cast.year == y)].sort_values(by = 'year'))
    return value

In [54]:
c = char_type('actor',1950)
print("The no.of roles were available for actors in the 1950s were '{}'".format(c))

The no.of roles were available for actors in the 1950s were '14653'

### How many roles were available for actresses in the 1950s?

In [56]:
c = char_type('actresses',1950)
print("The no.of roles were available for actresses in the 1950s were '{}'".format(c))

The no.of roles were available for actresses in the 1950s were '0'

### How many leading roles (n=1) were available from the beginning of film history through 1980?

In [57]:
r = len(cast[(cast.year >= 1980) &  (cast.n == 1)])
print("The no.of leading roles were available from the begining of film history through 1980 were '{}'".format(r))

The no.of leading roles were available from the begining of film history through 1980 were '53099'

### How many non-leading roles were available through from the beginning of film history through 1980?

In [58]:
r = len(cast[(cast.year >= 1980) &  (cast.n == 2)])
print("The no.of non-leading roles were available from the begining of film history through 1980 were '{}'".format(r))

The no.of leading roles were available from the begining of film history through 1980 were '38597'

### How many roles through 1980 were minor enough that they did not warrant a numeric "n" rank?

In [60]:
r = len(cast[(cast.year >= 1980) & (cast.n.isnull())])
print("The no.of roles through 1980 that they not a numeric 'n' rank were '{}'".format(r))

The no.of roles through 1980 that they not a numeric 'n' rank were '544058'